---
kind: property
id: P:Autodesk.Revit.DB.LineSegment.LineProperties
source: html/a163a075-7b43-68b0-756c-673b695b1ce1.htm
---
# Autodesk.Revit.DB.LineSegment.LineProperties Property

Access to the line (pen) properties of the line

## Syntax (C#)
```csharp
public LineProperties LineProperties { get; }
```